backend/tests/load-test.yml
config:
  target: "http://localhost:3001" # Replace with your deployment URL if testing a staging/production server
  phases:
    - duration: 60
      arrivalRate: 20
      rampTo: 100
      name: "Ramp up load (simulate 1000+ active sessions)"
scenarios:
  - name: "HTTP Canvas Downloader (New Joining Client)"
    weight: 3  # 30% of simulated users fetch the full board via REST
    flow:
      - get:
          url: "/api/canvas"
  - name: "Active WebSocket Pixel Placer"
    weight: 7  # 70% of simulated users place pixels via socket
    engine: socketio
    flow:
      - emit:
          channel: "place_pixel"
          data:
            x: "{{ $randomNumber(0, 63) }}"
            y: "{{ $randomNumber(0, 63) }}"
            color: "{{ $randomNumber(0, 15) }}"
      - think: 5